AdamFull/Dosimeter-SQUICK-STM32/Core/Inc/managers/data_manager.h
/*
 * data_manager.h
 *
 *  Created on: Aug 9, 2020
 *      Author: logot
 */

#ifndef INC_DATA_MANAGER_H_
#define INC_DATA_MANAGER_H_

#include "stdbool.h"
#include "stdint.h"
#include "stm32f1xx.h"

#define FLASH_START_ADDR ((uint32_t)0x08000000)
#define RAM_START_ADDR ((uint32_t)0x20000000)
#define FLASH_CONFIG_START_ADDR ((uint32_t)0x0800F000)
#define FLASH_CONFIG_END_ADDR FLASH_CONFIG_START_ADDR + FLASH_PAGE_SIZE
#define GOOD_CONFIG_KEY 0x2000CA32

typedef const char* string;

struct FLASH_sector{
	uint8_t data[2048-8];
	uint32_t NWrite;
	uint32_t CheckSum;
};

typedef struct {
	uint32_t CONFIG_KEY;
	uint32_t GEIGER_TIME;
	uint32_t GEIGER_ERROR;
	uint32_t GEIGER_VOLTAGE;

	uint32_t LCD_CONTRAST;
	uint32_t LCD_BACKLIGHT;

	uint32_t BUZZER_TONE;

	uint32_t ACTIVE_COUNTERS;	//0 - external, 1 - first, 2 - second, 3 - first + second together
	uint32_t SAVE_DOSE_INTERVAL;
	uint32_t ALARM_THRESHOLD;

	uint32_t rad_sum;

} geiger_settings;

typedef union {
	geiger_settings GSETTING;
	struct FLASH_sector sector;
	uint32_t data32[11];
} NVRAM;

typedef struct {
	uint8_t time_min_old;
	volatile uint8_t stat_time;
	volatile uint8_t time_min, time_sec;
	uint16_t sum_old;

	uint16_t real_geigertime;
	uint16_t transformer_pwm;
	volatile uint16_t timer_time, timer_remain;

	uint64_t rad_dose_old;
	volatile uint64_t rad_back, rad_max, rad_dose;

	unsigned long alarm_timer;

	uint16_t *rad_buff;
	uint16_t *stat_buff;		//Buffer for contain current stat values
} geiger_work;

typedef struct {
	uint16_t current_battery_voltage, current_high_voltage;
	float mean, std;
} geiger_meaning;

typedef struct {
	uint8_t counter_mode;
	uint8_t means_times;

} geiger_mode;

typedef struct {
	uint8_t page;
	uint8_t counter;
	uint8_t menu_page;
	uint8_t cursor;
	uint16_t editable;
	bool editable_bool;

	bool update_required;

	uint8_t mass[96];
	volatile uint8_t x_p;
} geiger_ui;

typedef struct {
	bool stop_timer;
	bool next_step;
	bool no_alarm;
	bool do_alarm;
	bool is_sleeping;
	bool is_editing_mode;
	bool is_alarm;
	bool is_muted;
	bool is_low_voltage;
	bool is_charging;
	bool is_charged;
	bool is_detected;
	bool is_memory_initialized;
	bool active_hv_gen;
	bool is_settings_readed;

	bool is_mean_mode;
} geiger_flags;

typedef  enum {
	NO_ERROR,
	FLASH_MEMORY_ERROR,
	HEAP_INITIALIZATION_ERROR,

} DMGRESULT;

void Initialize_variables();
void Initialize_data();
void Update_rad_buffer();

void Set_setting(uint32_t *value, uint32_t new_value);
void Accept_settings();
void Reset_to_defaults();

size_t GetRamFree();
size_t GetRomFree();

bool Init_memory();
bool Setup_memory();
string Read_memory(string file_name);
bool Write_memory(string file_name, string file_data);
bool is_memory_valid();

bool Read_configuration();
bool Write_configuration();

void Save_dose();


void Reset_dose();

void Reset_activity_test();

volatile void Calculate_std();

#endif /* INC_DATA_MANAGER_H_ */
